In [13]:
import pandas as pd

In [7]:
bigmac = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/bigmac.csv', parse_dates=['Date'])
bigmac.head(3)

        Date    Country  Price in US Dollars
0 2016-01-01  Argentina                 2.39
1 2016-01-01  Australia                 3.74
2 2016-01-01     Brazil                 3.35

In [10]:
bigmac.dtypes

Date                   datetime64[ns]
Country                        object
Price in US Dollars           float64
dtype: object

In [12]:
bigmac['Date'].unique

<bound method Series.unique of 0     2016-01-01
1     2016-01-01
2     2016-01-01
3     2016-01-01
4     2016-01-01
         ...
647   2010-01-01
648   2010-01-01
649   2010-01-01
650   2010-01-01
651   2010-01-01
Name: Date, Length: 652, dtype: datetime64[ns]>

Multi Index with set_index method

In [29]:
bigmac = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/bigmac.csv', parse_dates=['Date'])
bigmac.head(10)

        Date         Country  Price in US Dollars
0 2016-01-01       Argentina                 2.39
1 2016-01-01       Australia                 3.74
2 2016-01-01          Brazil                 3.35
3 2016-01-01         Britain                 4.22
4 2016-01-01          Canada                 4.14
5 2016-01-01           Chile                 2.94
6 2016-01-01           China                 2.68
7 2016-01-01        Colombia                 2.43
8 2016-01-01      Costa Rica                 4.02
9 2016-01-01  Czech Republic                 2.98

In [30]:
bigmac.set_index(keys=['Date', 'Country'], inplace=True)
bigmac.head(3)

                      Price in US Dollars
Date       Country
2016-01-01 Argentina                 2.39
           Australia                 3.74
           Brazil                    3.35

In [35]:
# bigmac.sort_index(inplace=True)
# bigmac.head()
bigmac.index.set_names(names=["Tanggal", "Negara"], inplace=True)

In [58]:
bigmac.sort_index(inplace=True)

In [65]:
# bigmac.loc[("2010-01-01", ), ["Price in US Dollars","Price in US Dollars"]]
bigmac.iloc[[0,1]]

                      Price in US Dollars
Tanggal    Negara
2010-01-01 Argentina                 1.84
           Australia                 3.98

Transpose method

In [2]:
import pandas as pd
bigmac = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/bigmac.csv', parse_dates=['Date'], index_col=['Date', 'Country'])
bigmac.sort_index(inplace=True)
bigmac.head(10)

                           Price in US Dollars
Date       Country
2010-01-01 Argentina                      1.84
           Australia                      3.98
           Brazil                         4.76
           Britain                        3.67
           Canada                         3.97
           Chile                          3.18
           China                          1.83
           Colombia                       3.91
           Costa Rica                     3.52
           Czech Republic                 3.71

In [4]:
bigmac = bigmac.transpose()
bigmac.head(3)

Date                2010-01-01                                              \
Country              Argentina Australia Brazil Britain Canada Chile China
Price in US Dollars       1.84      3.98   4.76    3.67   3.97  3.18  1.83

Date                                                    ...  2016-01-01  \
Country             Colombia Costa Rica Czech Republic  ... Switzerland
Price in US Dollars     3.91       3.52           3.71  ...        6.44

Date                                                                    \
Country             Taiwan Thailand Turkey   UAE Ukraine United States
Price in US Dollars   2.08     3.09   3.41  3.54    1.54          4.93

Date
Country             Uruguay Venezuela Vietnam
Price in US Dollars    3.74      0.66    2.67

[1 rows x 652 columns]

In [8]:
bigmac.loc[('Price in US Dollars',),('2010-01-01','Argentina'):('2010-01-01','Colombia')]

Date                2010-01-01                                              \
Country              Argentina Australia Brazil Britain Canada Chile China
Price in US Dollars       1.84      3.98   4.76    3.67   3.97  3.18  1.83

Date
Country             Colombia
Price in US Dollars     3.91

Swapleave method

In [9]:
import pandas as pd
bigmac = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/bigmac.csv', parse_dates=['Date'], index_col=['Date', 'Country'])
bigmac.sort_index(inplace=True)
bigmac.head(10)

                           Price in US Dollars
Date       Country
2010-01-01 Argentina                      1.84
           Australia                      3.98
           Brazil                         4.76
           Britain                        3.67
           Canada                         3.97
           Chile                          3.18
           China                          1.83
           Colombia                       3.91
           Costa Rica                     3.52
           Czech Republic                 3.71

In [15]:
bigmac.swaplevel()

bigmac.swaplevel('Date', 'Country')
bigmac.swaplevel('Country', 'Date')

bigmac.swaplevel(0, 1)
bigmac.swaplevel(1, 0)

                          Price in US Dollars
Country       Date
Argentina     2010-01-01                 1.84
Australia     2010-01-01                 3.98
Brazil        2010-01-01                 4.76
Britain       2010-01-01                 3.67
Canada        2010-01-01                 3.97
...                                       ...
Ukraine       2016-01-01                 1.54
United States 2016-01-01                 4.93
Uruguay       2016-01-01                 3.74
Venezuela     2016-01-01                 0.66
Vietnam       2016-01-01                 2.67

[652 rows x 1 columns]

In [16]:
bigmac = bigmac.swaplevel(0, 1)

In [17]:
bigmac.head(3)

                      Price in US Dollars
Country   Date
Argentina 2010-01-01                 1.84
Australia 2010-01-01                 3.98
Brazil    2010-01-01                 4.76

stack method

In [1]:
import pandas as pd
worldstats = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/worldstats.csv', index_col=['country', 'year'])
worldstats.sort_index(inplace=True)
worldstats.head(3)

                  Population           GDP
country     year
Afghanistan 1960   8994793.0  5.377778e+08
            1961   9164945.0  5.488889e+08
            1962   9343772.0  5.466667e+08

In [2]:
worldstats.stack()

country      year
Afghanistan  1960  Population    8.994793e+06
                   GDP           5.377778e+08
             1961  Population    9.164945e+06
                   GDP           5.488889e+08
             1962  Population    9.343772e+06
                                     ...
Zimbabwe     2013  GDP           1.349023e+10
             2014  Population    1.524586e+07
                   GDP           1.419691e+10
             2015  Population    1.560275e+07
                   GDP           1.389294e+10
Length: 22422, dtype: float64

In [3]:
worldstats.stack().to_frame()

                                        0
country     year
Afghanistan 1960 Population  8.994793e+06
                 GDP         5.377778e+08
            1961 Population  9.164945e+06
                 GDP         5.488889e+08
            1962 Population  9.343772e+06
...                                   ...
Zimbabwe    2013 GDP         1.349023e+10
            2014 Population  1.524586e+07
                 GDP         1.419691e+10
            2015 Population  1.560275e+07
                 GDP         1.389294e+10

[22422 rows x 1 columns]

In [6]:
type(worldstats.unstack().unstack())

pandas.core.series.Series

In [4]:
s = worldstats.stack()
s

country      year
Afghanistan  1960  Population    8.994793e+06
                   GDP           5.377778e+08
             1961  Population    9.164945e+06
                   GDP           5.488889e+08
             1962  Population    9.343772e+06
                                     ...
Zimbabwe     2013  GDP           1.349023e+10
             2014  Population    1.524586e+07
                   GDP           1.419691e+10
             2015  Population    1.560275e+07
                   GDP           1.389294e+10
Length: 22422, dtype: float64

In [8]:
s.loc[['Afghanistan','Zimbabwe']]

country      year
Afghanistan  1960  Population    8.994793e+06
                   GDP           5.377778e+08
             1961  Population    9.164945e+06
                   GDP           5.488889e+08
             1962  Population    9.343772e+06
                                     ...
Zimbabwe     2013  GDP           1.349023e+10
             2014  Population    1.524586e+07
                   GDP           1.419691e+10
             2015  Population    1.560275e+07
                   GDP           1.389294e+10
Length: 186, dtype: float64

In [16]:
s.unstack(level=[1,0])
# type(s.stack())
# s.to_excel('output.xls')

year,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
country,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,...,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe
Population,8.994793e+06,9.164945e+06,9.343772e+06,9.531555e+06,9.728645e+06,9.935358e+06,1.014884e+07,1.036860e+07,1.059979e+07,1.084951e+07,...,1.312794e+07,1.329780e+07,1.349546e+07,1.372100e+07,1.397390e+07,1.425559e+07,1.456548e+07,1.489809e+07,1.524586e+07,1.560275e+07
GDP,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,1.400000e+09,1.673333e+09,1.373333e+09,1.408889e+09,...,5.443896e+09,5.291950e+09,4.415703e+09,8.157077e+09,9.422161e+09,1.095623e+10,1.239272e+10,1.349023e+10,1.419691e+10,1.389294e+10

In [18]:
s.unstack(level="year", fill_value=0)

year                            1960          1961          1962  \
country
Afghanistan Population  8.994793e+06  9.164945e+06  9.343772e+06
            GDP         5.377778e+08  5.488889e+08  5.466667e+08
Albania     Population  0.000000e+00  0.000000e+00  0.000000e+00
            GDP         0.000000e+00  0.000000e+00  0.000000e+00
Algeria     Population  1.112489e+07  1.140486e+07  1.169015e+07
...                              ...           ...           ...
Yemen, Rep. GDP         0.000000e+00  0.000000e+00  0.000000e+00
Zambia      Population  3.049586e+06  3.142848e+06  3.240664e+06
            GDP         6.987397e+08  6.823597e+08  6.792797e+08
Zimbabwe    Population  3.752390e+06  3.876638e+06  4.006262e+06
            GDP         1.052990e+09  1.096647e+09  1.117602e+09

year                            1963          1964          1965  \
country
Afghanistan Population  9.531555e+06  9.728645e+06  9.935358e+06
            GDP         7.511112e+08  8.000000e+08  1.006667e+09
Albania     Population  0.000000e+00  0.000000e+00  0.000000e+00
            GDP         0.000000e+00  0.000000e+00  0.000000e+00
Algeria     Population  1.198513e+07  1.229597e+07  1.262695e+07
...                              ...           ...           ...
Yemen, Rep. GDP         0.000000e+00  0.000000e+00  0.000000e+00
Zambia      Population  3.342894e+06  3.449266e+06  3.559687e+06
            GDP         7.043397e+08  8.226397e+08  1.061200e+09
Zimbabwe    Population  4.140804e+06  4.279561e+06  4.422132e+06
            GDP         1.159512e+09  1.217138e+09  1.311436e+09

year                            1966          1967          1968  \
country
Afghanistan Population  1.014884e+07  1.036860e+07  1.059979e+07
            GDP         1.400000e+09  1.673333e+09  1.373333e+09
Albania     Population  0.000000e+00  0.000000e+00  0.000000e+00
            GDP         0.000000e+00  0.000000e+00  0.000000e+00
Algeria     Population  1.298027e+07  1.335420e+07  1.374438e+07
...                              ...           ...           ...
Yemen, Rep. GDP         0.000000e+00  0.000000e+00  0.000000e+00
Zambia      Population  3.674088e+06  3.792864e+06  3.916928e+06
            GDP         1.239000e+09  1.340639e+09  1.573739e+09
Zimbabwe    Population  4.568320e+06  4.718612e+06  4.874113e+06
            GDP         1.281750e+09  1.397002e+09  1.479600e+09

year                            1969  ...          2006          2007  \
country                               ...
Afghanistan Population  1.084951e+07  ...  2.518362e+07  2.587754e+07
            GDP         1.408889e+09  ...  7.057598e+09  9.843842e+09
Albania     Population  0.000000e+00  ...  2.992547e+06  2.970017e+06
            GDP         0.000000e+00  ...  8.992642e+09  1.070101e+10
Algeria     Population  1.414444e+07  ...  3.374933e+07  3.426197e+07
...                              ...  ...           ...           ...
Yemen, Rep. GDP         0.000000e+00  ...  1.908173e+10  2.563367e+10
Zambia      Population  4.047479e+06  ...  1.238151e+07  1.273868e+07
            GDP         1.926399e+09  ...  1.275686e+10  1.405696e+10
Zimbabwe    Population  5.036321e+06  ...  1.312794e+07  1.329780e+07
            GDP         1.747999e+09  ...  5.443896e+09  5.291950e+09

year                            2008          2009          2010  \
country
Afghanistan Population  2.652874e+07  2.720729e+07  2.796221e+07
            GDP         1.019053e+10  1.248694e+10  1.593680e+10
Albania     Population  2.947314e+06  2.927519e+06  2.913021e+06
            GDP         1.288135e+10  1.204421e+10  1.192695e+10
Algeria     Population  3.481106e+07  3.540179e+07  3.603616e+07
...                              ...           ...           ...
Yemen, Rep. GDP         3.039720e+10  2.845950e+10  3.090675e+10
Zambia      Population  1.311458e+07  1.350785e+07  1.391744e+07
            GDP         1.791086e+10  1.532834e+10  2.026555e+10
Zimbabwe    Population  1.349546e+07  1.372100e+07  1.397390e+07
            GDP         4.415703e+09  8.157077e+09  9.422161e+09

year                            2011          2012          2013  \
country
Afghanistan Population  2.880917e+07  2.972680e+07  3.068250e+07
            GDP         1.793024e+10  2.053654e+10  2.004633e+10
Albania     Population  2.904780e+06  2.900247e+06  2.896652e+06
            GDP         1.289087e+10  1.231978e+10  1.278103e+10
Algeria     Population  3.671713e+07  3.743943e+07  3.818614e+07
...                              ...           ...           ...
Yemen, Rep. GDP         3.107886e+10  3.207477e+10  3.595450e+10
Zambia      Population  1.434353e+07  1.478658e+07  1.524609e+07
            GDP         2.345952e+10  2.550306e+10  2.804552e+10
Zimbabwe    Population  1.425559e+07  1.456548e+07  1.489809e+07
            GDP         1.095623e+10  1.239272e+10  1.349023e+10

year                            2014          2015
country
Afghanistan Population  3.162751e+07  3.252656e+07
            GDP         2.005019e+10  1.919944e+10
Albania     Population  2.893654e+06  2.889167e+06
            GDP         1.327796e+10  1.145560e+10
Algeria     Population  3.893433e+07  3.966652e+07
...                              ...           ...
Yemen, Rep. GDP         0.000000e+00  0.000000e+00
Zambia      Population  1.572134e+07  1.621177e+07
            GDP         2.713464e+10  2.120156e+10
Zimbabwe    Population  1.524586e+07  1.560275e+07
            GDP         1.419691e+10  1.389294e+10

[504 rows x 56 columns]

# pivot method

In [25]:
import pandas as pd
sales = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/salesmen.csv', parse_dates=["Date"])
sales.info()
sales.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1830 entries, 0 to 1829
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      1830 non-null   datetime64[ns]
 1   Salesman  1830 non-null   object
 2   Revenue   1830 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 43.0+ KB

Date         366
Salesman       5
Revenue     1676
dtype: int64

In [26]:
sales["Salesman"] = sales["Salesman"].astype("category")

In [27]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1830 entries, 0 to 1829
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      1830 non-null   datetime64[ns]
 1   Salesman  1830 non-null   category
 2   Revenue   1830 non-null   int64
dtypes: category(1), datetime64[ns](1), int64(1)
memory usage: 30.7 KB

In [28]:
sales.head(3)

        Date Salesman  Revenue
0 2016-01-01      Bob     7172
1 2016-01-02      Bob     6362
2 2016-01-03      Bob     5982

In [30]:
sales.value_counts()

Date        Salesman  Revenue
2016-01-01  Bob       7172       1
2016-09-02  Ronald    5299       1
            Jeb       8239       1
            Dave      8638       1
            Bob       7870       1
                                ..
2016-05-01  Dave      9098       1
            Bob       3917       1
2016-04-30  Ronald    7051       1
            Oscar     267        1
2016-12-31  Ronald    2619       1
Length: 1830, dtype: int64

In [31]:
sales.pivot(index="Date", columns="Salesman", values="Revenue")

Salesman     Bob  Dave   Jeb  Oscar  Ronald
Date
2016-01-01  7172  1864  4430   5250    2639
2016-01-02  6362  8278  8026   8661    4951
2016-01-03  5982  4226  5188   7075    2703
2016-01-04  7917  3868  3144   2524    4258
2016-01-05  7837  2287   938   2793    7771
...          ...   ...   ...    ...     ...
2016-12-27  2045  2843  6666    835    2981
2016-12-28   100  8888  1243   3073    6129
2016-12-29  4115  9490  3498   6424    7662
2016-12-30  2577  3594  8858   7088    2570
2016-12-31  3845  6830  9717   8408    2619

[366 rows x 5 columns]

# The pivot_table method

In [33]:
import pandas as pd
foods = pd.read_csv('D:/udemy/data-analysis-with-pandas/part_one/foods.csv')
foods

    First Name  Gender          City Frequency       Item  Spend
0        Wanda  Female      Stamford    Weekly     Burger  15.66
1         Eric    Male      Stamford     Daily    Chalupa  10.56
2      Charles    Male      New York     Never      Sushi  42.14
3         Anna  Female  Philadelphia      Once  Ice Cream  11.01
4      Deborah  Female  Philadelphia     Daily    Chalupa  23.49
..         ...     ...           ...       ...        ...    ...
995      Donna  Female      New York   Monthly      Sushi  83.53
996     Albert    Male  Philadelphia     Daily      Sushi  72.88
997       Jean  Female      Stamford    Weekly      Donut   5.85
998    Jessica  Female      New York     Daily    Chalupa  43.19
999      Brian    Male      New York     Daily    Chalupa  28.36

[1000 rows x 6 columns]

In [36]:
foods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Gender      1000 non-null   object
 2   City        1000 non-null   object
 3   Frequency   1000 non-null   object
 4   Item        1000 non-null   object
 5   Spend       1000 non-null   float64
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [37]:
foods.nunique()

First Name    198
Gender          2
City            3
Frequency       8
Item            6
Spend         950
dtype: int64

In [38]:
foods["Gender"] = foods["Gender"].astype("category")
foods["City"] = foods["City"].astype("category")
foods["Frequency"] = foods["Frequency"].astype("category")
foods["Item"] = foods["Item"].astype("category")

In [51]:
foods.pivot_table(values="Spend", index=["First Name", "Item"], columns="City", aggfunc="min", fill_value=0)

City                  New York  Philadelphia  Stamford
First Name Item
Aaron      Burrito        0.00          0.00     95.07
           Chalupa        0.00         51.43      0.00
           Donut         48.00          0.00      0.00
           Ice Cream      0.00         89.85      0.00
Adam       Burrito        0.00          0.00      5.28
...                        ...           ...       ...
William    Ice Cream      0.00         54.34      0.00
           Sushi         49.18         68.14      0.00
Willie     Donut          0.00          0.00     16.11
           Ice Cream     95.45         67.89      0.00
           Sushi          5.12         17.26     67.67

[672 rows x 3 columns]

In [54]:
import pandas as pd
sales = pd.read_csv("D:/udemy/data-analysis-with-pandas/part_one/quarters.csv")
sales

  Salesman      Q1      Q2      Q3      Q4
0    Boris  602908  233879  354479   32704
1      Bob   43790  514863  297151  544493
2    Tommy  392668  113579  430882  247231
3   Travis  834663  266785  749238  570524
4   Donald  580935  411379  110390  651572
5      Ted  656644   70803  375948  321388
6      Jeb  486141  600753  742716  404995
7    Stacy  479662  742806  770712    2501
8   Morgan  992673  879183   37945  293710

In [57]:
pd.melt(sales, id_vars="Salesman", var_name="Quarter", value_name="Jumlah Penjualan")

   Salesman Quarter  Jumlah Penjualan
0     Boris      Q1            602908
1       Bob      Q1             43790
2     Tommy      Q1            392668
3    Travis      Q1            834663
4    Donald      Q1            580935
5       Ted      Q1            656644
6       Jeb      Q1            486141
7     Stacy      Q1            479662
8    Morgan      Q1            992673
9     Boris      Q2            233879
10      Bob      Q2            514863
11    Tommy      Q2            113579
12   Travis      Q2            266785
13   Donald      Q2            411379
14      Ted      Q2             70803
15      Jeb      Q2            600753
16    Stacy      Q2            742806
17   Morgan      Q2            879183
18    Boris      Q3            354479
19      Bob      Q3            297151
20    Tommy      Q3            430882
21   Travis      Q3            749238
22   Donald      Q3            110390
23      Ted      Q3            375948
24      Jeb      Q3            742716
25    Stacy      Q3            770712
26   Morgan      Q3             37945
27    Boris      Q4             32704
28      Bob      Q4            544493
29    Tommy      Q4            247231
30   Travis      Q4            570524
31   Donald      Q4            651572
32      Ted      Q4            321388
33      Jeb      Q4            404995
34    Stacy      Q4              2501
35   Morgan      Q4            293710